src/cf/InformationRegisters/НастройкиПечатиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПечатиОбъектов</Name>
			<Comment>// VOG Солодов В.В. 12.05.2020 CRM-631</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Comment>Не переносить в объединенные решения</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетПоУмолчанию</Name>
					<Comment>Не переносить в объединенные решения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключатьВСтоимость</Name>
					<Comment>Не переносить в объединенные решения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДСПоУмолчанию</Name>
					<Comment>Не переносить в объединенные решения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ОГРН</Name>
					<Comment>Не переносить в объединенные решения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеДляОтчетаГенеральномуДиректору</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокДляОтчетаГенеральномуДиректору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиПечатиОбъектов/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ЗаполнитьНастройкиПечатиОбъектов();
	
	Если НЕ ПраваПользователяПовтИсп.ДобавлениеИзменениеНастройкиПечатиОбъектов()
	 И НЕ ПраваПользователяПовтИсп.СохранениеНастроекПечатиОбъектовПоУмолчанию() Тогда
		Элементы.НастройкиПечатиОбъектовДобавить.Видимость = Ложь;
		Элементы.НастройкиПечатиОбъектовУдалить.Видимость  = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НастройкиПечатиОбъектов" Тогда
		ЗаполнитьНастройкиПечатиОбъектов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиПечатиОбъектов

&НаКлиенте
Процедура НастройкиПечатиОбъектовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Перем КлючЗаписи;
	
	Если Элемент.ТекущийЭлемент = Элементы.НастройкиПечатиОбъектовПредставление И
		Элементы.НастройкиПечатиОбъектов.ТекущиеДанные <> Неопределено И 
		Элементы.НастройкиПечатиОбъектов.ТекущиеДанные.ИндексКартинки = 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТипОбъекта 				= "";
		Организация 			= ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		НаправлениеДеятельности = ПредопределенноеЗначение("Справочник.НаправленияДеятельности.ПустаяСсылка");
		
		ТекущиеДанные = Элементы.НастройкиПечатиОбъектов.ТекущиеДанные;
		
		Если ТипЗнч(ТекущиеДанные.Настройка) = Тип("Строка") Тогда
			ТипОбъекта = ТекущиеДанные.Настройка;
		ИначеЕсли ТипЗнч(ТекущиеДанные.Настройка) = Тип("СправочникСсылка.Организации") Тогда
			ТипОбъекта 	= ТекущиеДанные.ПолучитьРодителя().Настройка;
			Организация = ТекущиеДанные.Настройка;
		ИначеЕсли ТипЗнч(ТекущиеДанные.Настройка) = Тип("СправочникСсылка.НаправленияДеятельности") Тогда
			ТипОбъекта 				= ТекущиеДанные.ПолучитьРодителя().ПолучитьРодителя().Настройка;
			Организация 			= ТекущиеДанные.ПолучитьРодителя().Настройка;
			НаправлениеДеятельности = ТекущиеДанные.Настройка;
		КонецЕсли;
		
		ДанныеКлючаЗаписи = Новый Структура();
		ДанныеКлючаЗаписи.Вставить("ТипОбъекта", 				ТипОбъекта);
		ДанныеКлючаЗаписи.Вставить("Организация", 				Организация);
		ДанныеКлючаЗаписи.Вставить("НаправлениеДеятельности", 	НаправлениеДеятельности);
		
		Если ЗаписьСуществует(ДанныеКлючаЗаписи) Тогда
			МассивПараметровКонструктора = Новый Массив();
			МассивПараметровКонструктора.Добавить(ДанныеКлючаЗаписи);
			
			КлючЗаписи = Новый("РегистрСведенийКлючЗаписи.НастройкиПечатиОбъектов", МассивПараметровКонструктора);
		КонецЕсли;
		
		ОткрытьФорму(
			"РегистрСведений.НастройкиПечатиОбъектов.ФормаЗаписи",
			Новый Структура("Ключ,ЗначенияЗаполнения",
			КлючЗаписи, ДанныеКлючаЗаписи),,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	
	ОткрытьФорму("РегистрСведений.НастройкиПечатиОбъектов.ФормаЗаписи",,,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	ТекущиеДанные = Элементы.НастройкиПечатиОбъектов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Укажите настройку печати для удаления'"));
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ИндексКартинки = 1 Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Невозможно удалить группировку'"));
		Возврат;
	КонецЕсли;
	
	СписокКнопок = Новый СписокЗначений();
	СписокКнопок.Добавить("Удалить", НСтр("ru = 'Удалить'"));
	СписокКнопок.Добавить("НеУдалять", НСтр("ru = 'Не удалять'"));
	
	ОтветНаВопрос = Неопределено;

	
	ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные)), НСтр("ru = 'Удалить настройку печати?'"), СписокКнопок);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
    
    
    ОтветНаВопрос = РезультатВопроса;
    
    Если ОтветНаВопрос = "НеУдалять" Тогда
        Возврат;
    КонецЕсли;
    
    ОчиститьСообщения();
    УдалитьНастройкуПечатиСервер(ТекущиеДанные.ПолучитьИдентификатор());

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьНастройкиПечатиОбъектов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНастройкиПечатиОбъектов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиПечатиОбъектов.ТипОбъекта КАК ТипОбъекта,
	|	НастройкиПечатиОбъектов.Организация КАК Организация,
	|	НастройкиПечатиОбъектов.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ИЗ
	|	РегистрСведений.НастройкиПечатиОбъектов КАК НастройкиПечатиОбъектов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипОбъекта,
	|	Организация,
	|	НаправлениеДеятельности
	|ИТОГИ ПО
	|	ТипОбъекта,
	|	Организация,
	|	НаправлениеДеятельности";
	
	РезультатЗапроса = Запрос.Выполнить();
	НастройкиПечатиОбъектов.ПолучитьЭлементы().Очистить();
	ДеревоЗначений = РеквизитФормыВЗначение("НастройкиПечатиОбъектов");
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаТипОбъекта = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаТипОбъекта.Следующий() Цикл
			
			СтрокаТипОбъекта = ДеревоЗначений.Строки.Добавить();
			СтрокаТипОбъекта.Настройка = ВыборкаТипОбъекта.ТипОбъекта;
			СтрокаТипОбъекта.Представление = Метаданные.НайтиПоПолномуИмени(ВыборкаТипОбъекта.ТипОбъекта).Представление();
			СтрокаТипОбъекта.ИндексКартинки = 1;
			
			ВыборкаОрганизация = ВыборкаТипОбъекта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаОрганизация.Следующий() Цикл
				
				Если Не ЗначениеЗаполнено(ВыборкаОрганизация.Организация) Тогда
					СтрокаТипОбъекта.ИндексКартинки = 0;
					Продолжить;
				КонецЕсли;
				
				СтрокаОрганизация = СтрокаТипОбъекта.Строки.Добавить();
				СтрокаОрганизация.Настройка = ВыборкаОрганизация.Организация;
				СтрокаОрганизация.Представление = ВыборкаОрганизация.Организация;
				СтрокаОрганизация.ИндексКартинки = 1;
				
				ВыборкаНаправлениеДеятельности = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаНаправлениеДеятельности.Следующий() Цикл
					
					Если Не ЗначениеЗаполнено(ВыборкаНаправлениеДеятельности.НаправлениеДеятельности) Тогда
						СтрокаОрганизация.ИндексКартинки = 0;
						Продолжить;
					КонецЕсли;
					
					СтрокаНаправлениеДеятельности = СтрокаОрганизация.Строки.Добавить();
					СтрокаНаправлениеДеятельности.Настройка = ВыборкаНаправлениеДеятельности.НаправлениеДеятельности;
					СтрокаНаправлениеДеятельности.Представление = ВыборкаНаправлениеДеятельности.НаправлениеДеятельности;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;

	ЗначениеВРеквизитФормы(ДеревоЗначений, "НастройкиПечатиОбъектов");
	
КонецПроцедуры

&НаСервере
Функция УдалитьНастройкуПечатиСервер(ИдентификаторСтроки)
	
	ТипОбъекта 				= "";
	Организация 			= Справочники.Организации.ПустаяСсылка();
	НаправлениеДеятельности = Справочники.НаправленияДеятельности.ПустаяСсылка();
	
	ТекущиеДанные = НастройкиПечатиОбъектов.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Настройка) = Тип("Строка") Тогда
		Если Не ПраваПользователяПовтИсп.СохранениеНастроекПечатиОбъектовПоУмолчанию() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нет прав на удаление настройки печати'"));
			Возврат Ложь;
		Иначе
			ТипОбъекта = ТекущиеДанные.Настройка;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ТекущиеДанные.Настройка) = Тип("СправочникСсылка.Организации") Тогда
		Если Не ПраваПользователяПовтИсп.СохранениеНастроекПечатиОбъектовПоУмолчанию() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нет прав на удаление настройки печати по организации'"));
			Возврат Ложь;
		Иначе
			ТипОбъекта  = ТекущиеДанные.ПолучитьРодителя().Настройка;
			Организация = ТекущиеДанные.Настройка;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ТекущиеДанные.Настройка) = Тип("СправочникСсылка.НаправленияДеятельности") Тогда
		Если Не ПраваПользователяПовтИсп.ДобавлениеИзменениеНастройкиПечатиОбъектов() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нет прав на удаление настройки печати по направлению деятельности'"));
			Возврат Ложь;
		Иначе
			ТипОбъекта 				= ТекущиеДанные.ПолучитьРодителя().ПолучитьРодителя().Настройка;
			Организация 			= ТекущиеДанные.ПолучитьРодителя().Настройка;
			НаправлениеДеятельности = ТекущиеДанные.Настройка;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеКлючаЗаписи = Новый Структура();
	ДанныеКлючаЗаписи.Вставить("ТипОбъекта", 				ТипОбъекта);
	ДанныеКлючаЗаписи.Вставить("Организация", 				Организация);
	ДанныеКлючаЗаписи.Вставить("НаправлениеДеятельности", 	НаправлениеДеятельности);
	
	Если ЗаписьСуществует(ДанныеКлючаЗаписи) Тогда
		
		МассивПараметровКонструктора = Новый Массив();
		МассивПараметровКонструктора.Добавить(ДанныеКлючаЗаписи);
		РегистрыСведений.НастройкиПечатиОбъектов.УдалитьНастройкиПечатиОбъекта(ТипОбъекта, Организация, НаправлениеДеятельности);
		ЗаполнитьНастройкиПечатиОбъектов();
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗаписьСуществует(ДанныеКлючаЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиПечатиОбъектов.ТипОбъекта КАК ТипОбъекта
	|ИЗ
	|	РегистрСведений.НастройкиПечатиОбъектов КАК НастройкиПечатиОбъектов
	|ГДЕ
	|	НастройкиПечатиОбъектов.ТипОбъекта = &ТипОбъекта
	|	И НастройкиПечатиОбъектов.Организация = &Организация
	|	И НастройкиПечатиОбъектов.НаправлениеДеятельности = &НаправлениеДеятельности";
	
	Запрос.УстановитьПараметр("ТипОбъекта", 				ДанныеКлючаЗаписи.ТипОбъекта);
	Запрос.УстановитьПараметр("Организация", 				ДанныеКлючаЗаписи.Организация);
	Запрос.УстановитьПараметр("НаправлениеДеятельности", 	ДанныеКлючаЗаписи.НаправлениеДеятельности);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти
